/**
 * ╔═══╦══════════════════════╦══════════════╦═════════════════════════════════════════╗
 * ║Stt║      Thông tin       ║ Kiểu dữ liệu ║                Ghi chú                  ║
 * ╠═══╬══════════════════════╬══════════════╬═════════════════════════════════════════╣
 * ║ 1 ║ Mã số sinh viên      ║ Chuỗi ký tự  ║ 10 ký tự                                ║
 * ╠═══╬══════════════════════╬══════════════╬═════════════════════════════════════════╣
 * ║ 2 ║ Họ và tên            ║ Chuỗi ký tự  ║ Tối đa 30 ký tự                         ║
 * ╠═══╬══════════════════════╬══════════════╬═════════════════════════════════════════╣
 * ║ 3 ║ Năm sinh             ║ Số nguyên    ║ Ví dụ: 2010, 2011                       ║
 * ╠═══╬══════════════════════╬══════════════╬═════════════════════════════════════════╣
 * ║ 4 ║ Giới tính            ║ Số nguyên    ║ 0: năm; 1: nữ                           ║
 * ╠═══╬══════════════════════╬══════════════╬═════════════════════════════════════════╣
 * ║ 5 ║ Số lượng môn đã học  ║ Số nguyên    ║                                         ║
 * ╠═══╬══════════════════════╬══════════════╬═════════════════════════════════════════╣
 * ║ 6 ║ Danh sách môn học đã ║ Mảng 1 chiều ║ Mỗi môn học gồm có 2 thông tin: tên môn ║
 * ║   ║ học                  ║              ║ học (tối đa 30 ký tự) và điểm (số thực) ║
 * ╚═══╩══════════════════════╩══════════════╩═════════════════════════════════════════╝
 * 
 * 1. Hãy dùng "struct" để định nghĩa kiểu dữ liệu có cấu trúc cho "SinhVien" trên
 * 2. Viết hàm nhập mảng 1 chiều gốm n sinh viên (danh sách sinh viên)
 * 3. Viết hàm tìm sinh viên có mã số x
 * 4. Viết hàm sắp xếp danh sách sinh viên vào theo thứ tự tăng dần của năm sinh
 * 5. Viết hàm lưu danh sách sinh viên vào tập tin nhị phân với tên tập tin là "dssv.dat" tại
 *    thư mục chứa mã nguồn của chương trình
*/